#ifndef __circle__
#define __circle__

//------------------------------------------------------------------------------
// circle.h - содержит описание окружности  и ее интерфейса
//------------------------------------------------------------------------------
#include <fstream>
#include <cmath>

struct Circle
{
    int x;
    int y;
    int rad;

    enum Color
    {
        RED,
        ORANGE,
        YELLOW,
        GREEN,
        LIGHT_BLUE,
        BLUE,
        VIOLET,
    } color;

    int In(FILE *input_file);

    //------------------------------------------------------------------------------
    // Вывод параметров окружности в поток
    void Out(FILE *output_file);

    //------------------------------------------------------------------------------
    // Вычисление периметра окружности
    double Perimeter();

    //------------------------------------------------------------------------------
    // Представление цвета окружности в строковом формате
    std::string ColorToString(Color color);

    //------------------------------------------------------------------------------
    // Получение цвета окружности из строки
    Color GetColor(char color_type[10001]);
};
#endif //__circle__