#ifndef __container__
#define __container__

//------------------------------------------------------------------------------
// container.h - содержит описание контейнера и его интерфейса
//------------------------------------------------------------------------------

#include "shape.h"
#include <cstdlib>

// Контейнер
struct Container {
    int size{0};

    //------------------------------------------------------------------------------
    // Содержимое контейнера
    Shape content[10002];

    //------------------------------------------------------------------------------
    // Ввод содержимого контейнера из файла
    void In(FILE* input_file);

    //------------------------------------------------------------------------------
    // Вывод содержимого контейнера в файл
    void Out(FILE* output_file);

    //------------------------------------------------------------------------------
    // Сортировка элементов контейнера
    void SortElements();
};
#endif //__container__