//------------------------------------------------------------------------------
// shape.h - содержит описание обобщающей геометрической фигуры,
//------------------------------------------------------------------------------

#ifndef __shape__
#define __shape__

#include "rectangle.h"
#include "triangle.h"
#include "circle.h"
#include <cstring>
#include <iostream>

// Структура, обобщающая все имеющиеся фигуры
struct Shape
{
    //------------------------------------------------------------------------------
    // Значения ключей для каждой из фигур
    enum shape_type
    {
        CIRCLE,
        RECTANGLE,
        TRIANGLE
    } shape_type;
    union
    { // Используем простейшую реализацию
        Circle circle;
        Rectangle rectangle;
        Triangle triangle;
    };

    //------------------------------------------------------------------------------
    // Получение числового значения, соответствующего типу фигуры
    int GetIntType(char str_type[10001]);

    //------------------------------------------------------------------------------
    // Ввод параметров обобщенной фигуры из файла
    int In(FILE *input_file);

    //------------------------------------------------------------------------------
    // Вывод параметров текущей фигуры в поток
    void Out(FILE *output_file);

    //------------------------------------------------------------------------------
    // Вычисление периметра фигуры
    double Perimeter();
};

#endif //__shape__