#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание треугольника и его интерфейса
//------------------------------------------------------------------------------

#include <fstream>
#include <cmath>

// Треугольник
struct Triangle {
    int x1, y1; // координаты первой вершины треугольника
    int x2, y2; // координаты второй вершины треугольника
    int x3, y3; // координаты третьей вершины треугольника

   
   // Цвета треугольника
    enum Color {
        RED,
        ORANGE,
        YELLOW,
        GREEN,
        LIGHT_BLUE,
        BLUE,
        VIOLET,
    } color;

    //------------------------------------------------------------------------------
    // Ввод параметров треугольника из файла
    int In(FILE* input_file);

    //------------------------------------------------------------------------------
    // Вывод параметров треугольника в файл
    void Out(FILE* output_file);

    //------------------------------------------------------------------------------
    // Вычисление периметра треугольника
    double Perimeter();

    //------------------------------------------------------------------------------
    // Вычисление стороны треугольника
    double Side(int x1, int y1, int x2, int y2);
    
    //------------------------------------------------------------------------------
    // Представление цвета треугольника в строковом формате
    std::string ColorToString(Color color);

    //------------------------------------------------------------------------------
    // Получение цвета треугольника из строки
    Color GetColor(char colot_type[10001]);
};   

#endif //__triangle__