#ifndef __circle__
#define __circle__

//------------------------------------------------------------------------------
// circle.h - содержит описание окружности  и ее интерфейса
//------------------------------------------------------------------------------
#include "shape.h"
#include <fstream>
#include <cmath>

class Circle : public Shape
{
    private:
    int x, y, rad; // координаты центра и радиус окружности

public:
    //------------------------------------------------------------------------------
    // Ввод параметров окружности из файла
    virtual int In(FILE *input_file);

    //------------------------------------------------------------------------------
    // Рандомная генерация параметров окружности
    virtual void InRnd(FILE *input_rnd);

    //------------------------------------------------------------------------------
    // Вывод параметров окружности в поток
    virtual void Out(FILE *output_file);

    //------------------------------------------------------------------------------
    // Вычисление периметра окружности
    virtual double Perimeter();

    //------------------------------------------------------------------------------
    // Получение цвета окружности из строки
    virtual Color GetColor(char color_type[10001]);

    //------------------------------------------------------------------------------
    // Получение строкового представления цвета окружности
    virtual std::string ColorToString(Color color);

};
#endif //__circle__