//------------------------------------------------------------------------------
// shape.h - содержит описание обобщающей геометрической фигуры,
//------------------------------------------------------------------------------

#ifndef __shape__
#define __shape__

#include "rnd.h"
#include <fstream>
#include <cstring>

// Структура, обобщающая все имеющиеся фигуры
class Shape
{
    protected:
        static Random rnd1000;
        static Random rnd3;
        static Random rnd7;
    public:
        //------------------------------------------------------------------------------
        // Цвета фигуры
        enum Color {
            RED,
            ORANGE,
            YELLOW,
            GREEN,
            LIGHT_BLUE,
            BLUE,
            VIOLET,
        } color;

        //------------------------------------------------------------------------------
        // Получение числового значения, соответствующего типу фигуры
        static int GetIntType(char str_type[10001]);

        //------------------------------------------------------------------------------
        // Ввод параметров обобщенной фигуры из файла
        static Shape *StaticIn(FILE *input_file);

        //------------------------------------------------------------------------------
        // Рандомная генерация параметров обобщенной фигуры
        static Shape *StaticInRnd(FILE *input_rnd);
       
        //------------------------------------------------------------------------------
        // Вывод параметров текущей фигуры в файл
        virtual void Out(FILE *output_file) = 0;

        //------------------------------------------------------------------------------
        // Вычисление периметра фигуры
        virtual double Perimeter() = 0;
};

#endif //__shape__