#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание треугольника и его интерфейса
//------------------------------------------------------------------------------
#include "shape.h"
#include <fstream>
#include <cmath>

// Треугольник
class Triangle : public Shape {
private:
    int x1, y1, x2, y2, x3, y3; // координаты вершин треугольника
public:
    //------------------------------------------------------------------------------
    // Ввод параметров треугольника из файла
    virtual int In(FILE* input_file);

    //------------------------------------------------------------------------------
    // Рандомная генерация параметров треугольника
    virtual void InRnd(FILE *input_rnd);

    //------------------------------------------------------------------------------
    // Вывод параметров треугольника в файл
    virtual void Out(FILE* output_file);

    //------------------------------------------------------------------------------
    // Вычисление периметра треугольника
    virtual double Perimeter();

    //------------------------------------------------------------------------------
    // Получение цвета треугольника из строки
    virtual Color GetColor(char color_type[10001]);

    //------------------------------------------------------------------------------
    // Представление цвета треугольника в строковом формате
    virtual std::string ColorToString(Color color);

    //------------------------------------------------------------------------------
    // Вычисление стороны треугольника
    double Side(int x1, int y1, int x2, int y2);
};   

#endif //__triangle__